Tekla Open API Reference for Tekla Structures 2025
Boolean.Value Property
 Gets or sets the boolean value.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Value { get; set; }
Public Property Value As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Boolean Structure
Tekla.Structures.Datatype Namespace